УТ/src/InformationRegisters/CRM_СообщенияДиалоговПоследние/CRM_СообщенияДиалоговПоследние.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_СообщенияДиалоговПоследние</name>
  <resources>
    <name>Сообщение</name>
    <type>
      <types>DocumentRef.CRM_СообщениеМессенджера</types>
    </type>
  </resources>
  <resources>
    <name>ВидСообщения</name>
    <type>
      <types>EnumRef.CRM_ВидыСообщенияМессенджера</types>
    </type>
  </resources>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСокр</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАРМ</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Диалог</name>
    <type>
      <types>CatalogRef.CRM_Диалоги</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ/src/InformationRegisters/CRM_СообщенияДиалоговПоследние/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
         Возврат;
    КонецЕсли;
	
	ОтборДиалог = Отбор.Найти("Диалог");
	Если ОтборДиалог <> Неопределено Тогда
		ТекущийДиалог = ОтборДиалог.Значение;
		Если ЗначениеЗаполнено(ТекущийДиалог) Тогда
			
			Для Каждого ЗаписьНЗ Из ЭтотОбъект Цикл
				Если ЗаписьНЗ.ВидСообщения = Перечисления.CRM_ВидыСообщенияМессенджера.Входящее Тогда
					
					Если ТекущийДиалог.Статус = Перечисления.CRM_СтатусыДиалогов.Новый Тогда
						ЗаписьНЗ.ДатаАРМ = ЗаписьНЗ.Дата;
					Иначе
						ПоследнееСообщение = CRM_РаботаСМессенджерамиСервер.ПоследнееСообщениеДиалога(ТекущийДиалог);
						
						Если ПоследнееСообщение = Неопределено Тогда
							ЗаписьНЗ.ДатаАРМ = ЗаписьНЗ.Дата;
							Продолжить;
						КонецЕсли;
						
						Если ПоследнееСообщение.ВидСообщения = Перечисления.CRM_ВидыСообщенияМессенджера.Исходящее Тогда
							ЗаписьНЗ.ДатаАРМ = ЗаписьНЗ.Дата;
						Иначе // Если это повторное входящее сообщение НЕ нового диалога, тогда дата для сортировки не должна измениться:
							Если ТипЗнч(ПоследнееСообщение) = Тип("Структура") И ЗначениеЗаполнено(ПоследнееСообщение.ДатаАРМ) Тогда
								ЗаписьНЗ.ДатаАРМ = ПоследнееСообщение.ДатаАРМ;
							Иначе
								ЗаписьНЗ.ДатаАРМ = ЗаписьНЗ.Дата;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
